---
kind: type
id: T:Autodesk.Revit.DB.MeshTriangle
source: html/00af4985-b107-cb1a-8954-b4078a9347ad.htm
---
# Autodesk.Revit.DB.MeshTriangle

One triangle of a mesh.

## Syntax (C#)
```csharp
public class MeshTriangle
```